#include <stdio.h>

/*
1. 写代码区分以下 4 种指针：
int *p;           // 指向整数的指针
int *arr[5];      // 指针数组（数组里存了5个指针）
int (*p)[5];      // 数组指针（指向包含5个整数的数组）
int (*fp)(int);   // 函数指针
*/

int main()
{
    // 第一种指针-----------------> 指向整数的指针
    int value[5] = {0, 1, 2, 3, 4};
    int *p = &value[0];
    printf("%d  address is %p\n", value[0], p);

    // 第二种指针-----------------> 指针数组(本质是一个数组，其中的数组存储位指针)
    int *p1[5];
    for(int i = 0; i < 5; i++)
    {
        p1[i] = &value[i];
        printf("%d ", *p1[i]);
    }
    printf("\n");

    // 第三种指针-----------------> 数组指针(本质为一个指针，但是这个指针是指向数组的)
    int (*p2)[5] = &value;
    for(int i = 0; i < 5; i++)
    {
        printf("%d ", (*p2)[i]);
    }

    // 第四种指针-----------------> 指针函数(本质为一个函数，但是这个函数返回的位指针)
    // int *func(int a);
    return 0;
}